In [1]:
#ques 1

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import logging

logging.basicConfig(filename='Pandas.txt',level=logging.DEBUG,format='%(asctime)s %(levelname)s %(message)s')
def create_series(data):
    try:
        series=pd.Series(data)
        logging.info("Series created")
        return series
    except Exception as e:
        logging.error(f'Error occured while creating series : {str(e)}')
        return None

In [4]:
data = [4, 8, 15, 16, 23, 42]
create_series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
#ques 2

In [6]:

data1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] # List of 10 elements
series = pd.Series(data)
logging.info(series)
print( series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
#ques 3

In [8]:
data2={'Name':['Alice','Bob','Claire'],
        'Age':[25, 30,27],
        'Gender':['Female','Male','Female']
       }
df=pd.DataFrame(data2)
logging.info(df)

In [9]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Alternative

In [10]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Claire'],
                    'Age': [25, 30, 27],
                    'Gender': ['Female', 'Male', 'Female']
                   })

print(df1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [11]:
#ques 4

In pandas, a DataFrame is a two-dimensional data structure that represents tabular data. It consists of rows and columns, similar to a spreadsheet or a SQL table. Each column in a DataFrame represents a variable or a feature, while each row represents a data point or an observation.

A DataFrame can be thought of as a collection of Pandas Series objects, where each Series represents a column of the DataFrame. The key difference between a DataFrame and a Series is that a DataFrame can hold multiple columns of different data types, whereas a Series represents a single column with homogeneous data.

In [12]:

ser = pd.Series([1, 2, 3, 4, 5])
logging.info("Series:")
logging.info(ser)


df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e']},index=['i', 'ii', 'iii', 'iv', 'v'])
logging.info("\nDataFrame:")
logging.info(df)

In [13]:
df

     A  B
i    1  a
ii   2  b
iii  3  c
iv   4  d
v    5  e

In [14]:
#ques 5

Pandas provides a wide range of functions for data manipulation in a DataFrame. Here are some common functions:

head() - Returns the first n rows of the DataFrame.
Example: df.head(5) returns the first 5 rows of the DataFrame.

In [15]:
df.head()

     A  B
i    1  a
ii   2  b
iii  3  c
iv   4  d
v    5  e

tail() - Returns the last n rows of the DataFrame.
Example: df.tail(5) returns the last 5 rows of the DataFrame.

In [16]:
df.tail()

     A  B
i    1  a
ii   2  b
iii  3  c
iv   4  d
v    5  e

info() - Provides information about the DataFrame, including the data types, column names, and memory usage.
Example: df.info() provides information about the DataFrame.

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, i to v
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      object
dtypes: int64(1), object(1)
memory usage: 120.0+ bytes

describe() - Generates descriptive statistics of the DataFrame, including count, mean, min, max, etc., for each numerical column.
Example: df.describe() provides descriptive statistics of the DataFrame.

In [18]:
df.describe()

              A
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

shape - Returns the dimensions of the DataFrame (number of rows, number of columns).
Example: df.shape returns the shape of the DataFrame.

drop() - Drops specified rows or columns from the DataFrame.
Example: df.drop('column_name', axis=1) drops the specified column from the DataFrame.

In [19]:
df.drop('A',axis=1)

     B
i    a
ii   b
iii  c
iv   d
v    e

groupby() - Groups the data based on one or more columns and allows performing aggregations on the grouped data.
Example: df.groupby('column_name').mean() calculates the mean value for each group based on the column_name.

In [20]:
df.groupby('A')

sort_values() - Sorts the DataFrame based on one or more columns.
Example: df.sort_values('column_name', ascending=False) sorts the DataFrame in descending order based on the column_name.

In [21]:
df.sort_values('A',ascending=False)

     A  B
v    5  e
iv   4  d
iii  3  c
ii   2  b
i    1  a

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
#ques 6

DataFrame is mutable, which means it can be modified after creation. We can add, delete, or modify rows or columns in a DataFrame.
This allows for flexible data manipulation and updating of the underlying data structure.

On the other hand, Series and Panel are immutable in nature. Once created, you cannot modify them directly.
If we need to make changes, we would typically create a new Series or Panel with the desired modifications.

In [24]:
#ques 7

In [25]:
series1=pd.Series([1,2,3,4,5])
series2=pd.Series([2,4,6,8,10])
series3=pd.Series([3,6,9,12,15])
series4=pd.Series(['a','b','c','d','e'])

In [26]:
data_frame=pd.DataFrame({'Key1':series1,
                         'Key2':series2,
                         'Key3':series3,
                         'Key4':series4
                        })

In [27]:
logging.info("\ndate_frame:")
logging.info(data_frame)
print(data_frame)

   Key1  Key2  Key3 Key4
0     1     2     3    a
1     2     4     6    b
2     3     6     9    c
3     4     8    12    d
4     5    10    15    e